{
  "bill_id": "HR.3076",
  "congress": 117,
  "model": "all-mpnet-base-v2",
  "ranking": "hybrid_dense_tfidf_dynamic_keywords_industry_prior",
  "topk": 5,
  "results": [
    {
      "ticker": "UPS",
      "name": "United Parcel Service",
      "sector": "Industrials",
      "industry": "Air Freight & Logistics",
      "description": "United Parcel Service, Inc., a package delivery and logistics provider, offers transportation and delivery services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery services for express letters, documents, packages and palletized freight through air and ground services in the United States. The International Package segment provides small package operations in Europe, the Indian sub-continent, the Middle East and Africa, Canada and Latin America, and Asia. The company offers a range of guaranteed day- and time-definite international shipping services; day-definite services; cross-border ground package delivery; contract-only, e-commerce solutions for non-urgent, and cross-border shipments; and international service for urgent and palletized shipments. It also provides international air and ocean freight forwarding, contract logistics, custom brokerage and insurance, mail services, healthcare logistics, distribution, and post-sales services. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.",
      "hybrid_score": 0.43589248558825816,
      "bill_snippet": "Postal Service Reform Act of 202 2 This bill addresses the finances and operations of the U.S. Postal Service (USPS). The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Pr..."
    },
    {
      "ticker": "ELV",
      "name": "Elevance Health",
      "sector": "Health Care",
      "industry": "Managed Health Care",
      "description": "Elevance Health, Inc., together with its subsidiaries, operates as a health benefits company in the United States. It operates in four segments: Health Benefits, CarelonRx, Carelon Services, and Corporate & Other. The company offers a variety of health plans and services to individual, employer group risk-based and fee-based, BlueCard, Medicare, Medicaid, and FEP members; health products; a broad array of fee-based administrative managed care services; and specialty and other insurance products and services, such as stop loss, dental, vision, and supplemental health insurance benefits. It also operates in the pharmacy services business; and markets and offers pharmacy services, including home delivery and specialty pharmacies, claims adjudication, formulary management, pharmacy networks, rebate administration, a prescription drug database, and member services, as well as infusion services and injectable therapies through ambulatory infusion centers. In addition, the company provides healthcare related services and capabilities, including specialty care enablement and utilization management support for specialized clinical domains; behavioral health and comprehensive care management services; palliative care services and management; virtual care; and payment integrity, subrogation, clinical data exchange through its HealthOS platform, research and data, reporting and clinical analytics, information technology, and business process support services, as well as manages home health, post-acute institutional management, and durable medical equipment costs; and supports plans in managing home and community-based services. It provides its services under the Anthem Blue Cross and Blue Shield, Wellpoint, and Carelon brands. The company was formerly known as Anthem, Inc. and changed its name to Elevance Health, Inc. in June 2022. Elevance Health, Inc. was incorporated in 2001 and is headquartered in Indianapolis, Indiana.",
      "hybrid_score": 0.3821730154211036,
      "bill_snippet": "Postal Service Reform Act of 202 2 This bill addresses the finances and operations of the U.S. Postal Service (USPS). The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Pr..."
    },
    {
      "ticker": "JKHY",
      "name": "Jack Henry & Associates",
      "sector": "Financials",
      "industry": "Transaction & Payment Processing Services",
      "description": "Jack Henry & Associates, Inc. operates as a financial technology company that connects people and financial institutions through technology solutions and payment processing services. It operates through four segments: Core, Payments, Complementary, and Corporate and Other. The Core segment provides core information processing platforms to banks and credit unions, which consist of integrated applications required to process deposit, loan, general ledger transactions, and maintain centralized accountholder information. The Payments segment offers secure payment processing tools and services, including ATM, automated clearing house origination and remote deposit capture processing, and risk management products and services, as well as debit and credit card processing services, and online and mobile bill pay solutions. The Complementary segment provides software, and hosted processing platforms and services comprising digital/mobile banking, treasury, online account opening, fraud/anti-money laundering, and lending/deposit solutions. The Corporate and Other segment offers hardware and other products. It offers specialized financial performance, imaging and payment, information security and risk management, retail delivery, and online and mobile solutions to financial services organizations and corporate entities. The company also provides SilverLake system, a system primarily designed for commercial-focused banks; Symitar, a system designed for credit unions; CIF 20/20, a parameter-driven system for banks; and Core Director, a system with point-and-click operation for banks. It provides digital products and services under the Banno Digital Platform, and electronic payment solutions; hardware systems; implementation, training, and support and service solutions; data center solutions; and data and transaction processing, and software licensing and related services, as well as professional services. The company was founded in 1976 and is headquartered in Monett, Missouri.",
      "hybrid_score": 0.3810963147611067,
      "bill_snippet": "Postal Service Reform Act of 202 2 This bill addresses the finances and operations of the U.S. Postal Service (USPS). The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Pr..."
    },
    {
      "ticker": "PFG",
      "name": "Principal Financial Group",
      "sector": "Financials",
      "industry": "Life & Health Insurance",
      "description": "Principal Financial Group, Inc. provides retirement, asset management, and insurance products and services to businesses, individuals, and institutional clients worldwide. The company operates through Retirement and Income Solutions, Principal Asset Management, and Benefits and Protection segments. The Retirement and Income Solutions segment provides retirement, and related financial products and services. This segment offers products and services for defined contribution plans, including 401(k) and 403(b) plans, defined benefit plans, nonqualified executive benefit plans, employee stock ownership plans, equity compensation, and pension risk transfer services; individual retirement accounts; investment only products; and mutual funds, individual variable annuities, registered index-linked annuities, and bank products, as well as trust and custody services. The Principal Asset Management segment provides equity, fixed income, real estate, and other alternative investments, as well as fund offerings. This segment also offers pension accumulation products and services, mutual funds, asset management, income annuities, and life insurance accumulation products, as well as voluntary savings plans. The Benefits and Protection segment provides specialty benefits, such as group dental and vision insurance, group life and other insurance, and group and individual disability insurance, as well as administers group dental, disability, and vision benefits; and individual life insurance products comprising universal, variable universal, indexed universal, and term life insurance products. This segment also offers insurance solutions for small and medium-sized businesses and their owners, as well as employees. The company was founded in 1879 and is based in Des Moines, Iowa.",
      "hybrid_score": 0.377262881591261,
      "bill_snippet": "Postal Service Reform Act of 202 2 This bill addresses the finances and operations of the U.S. Postal Service (USPS). The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Pr..."
    },
    {
      "ticker": "PAYX",
      "name": "Paychex",
      "sector": "Industrials",
      "industry": "Human Resource & Employment Services",
      "description": "Paychex, Inc., together with its subsidiaries, provides human capital management solutions (HCM) for payroll, employee benefits, human resources (HR), and insurance services for small to medium-sized businesses in the United States, Europe, and India. It offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services. The company provides retirement solutions, such as plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services; HCM solutions from recruiting and hiring to retirement; and talent management and talent acquisition services. In addition, it offers payroll solutions, including calculation, preparation, and delivery of employee payroll checks; production of internal accounting records and management reports; preparation of federal, state, and local payroll tax returns; and collection and remittance of clients' payroll obligations. Further, the company provides workforce management solutions; benefits administration solutions; digital marketplace for earned wages, financial wellness solutions, and voluntary lifestyle benefits; HR support to non-payroll clients through HR Partner Plus solution; and insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. Additionally, it offers payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and both virtual and on-site availability of a professionally trained HR representative, and other solutions to businesses. It markets and sells its services primarily through its direct sales force. The company was founded in 1971 and is headquartered in Rochester, New York.",
      "hybrid_score": 0.3727488146718733,
      "bill_snippet": "Postal Service Reform Act of 202 2 This bill addresses the finances and operations of the U.S. Postal Service (USPS). The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Pr..."
    }
  ],
  "clean_text_path": "bill_texts/hr.3076_clean.txt"
}